# Homework number 1 by Daniil Ivanov

example = 'Daniil'

# Выведите на экран(в консоль) первый символ этой строки.
print(example[0])

# Выведите на экран(в консоль) последний символ этой строки (используя отрицательный индекс).
print(example[-1])

# Выведите на экран(в консоль) вторую половину этой строки (С нечётным количеством символов: 'Urban' -> 'ban').
print(example[2:])

# Выведите на экран(в консоль) это слово наоборот.
print(example[::-1])

# Выведите на экран(в консоль) каждый второй символ этой строки.
print(example[::2])

